/*
This file is part of the OdinMS Maple Story Server
Copyright (C) 2008 ~ 2010 Patrick Huy <patrick.huy@frz.cc> 
Matthias Butz <matze@odinms.de>
Jan Christian Meyer <vimes@odinms.de>
This program is free software: you can redistribute it and/or modify
it under the terms of the GNU Affero General Public License version 3
as published by the Free Software Foundation. You may not use, modify
or distribute this program under any other version of the
GNU Affero General Public License.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU Affero General Public License for more details.

You should have received a copy of the GNU Affero General Public License
along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
/*
 * NPCID : 2040022
 * ScriptName : make_ludi4
 * NPCNameFunc : 라이돌 - 무기 제작자
 * Location : 220020600 (루디브리엄성 - 장난감공장<기계실>)
 * 
 * @author T-Sun
 *
 */

var status = 0;
function start() {
    status = -1;
    action(1,0,0);
}
function action(mode, type, selection) {
    if (mode == 1 && type != 1) {
        status++;
    } else {
        if (type == 1 && mode == 1) {
            status++;
            selection = 1;
        } else if (type == 1 && mode == 0) {
            status++;
            selection = 0;
        } else {
            cm.dispose();
            return;
        }
    }
	if (status == 0)
	{
		var str = "공장 여기까지 어쩐 일인가..? 필요한 것이라도 있나? \r\n#b";
		str += "#L0# 촉진제가 뭐죠?#l\r\n";
		str += "#L1# 제조법이 뭐죠?#l\r\n";
		str += "#L2# 촉진제로 한손 무기 제작#l\r\n";
		str += "#L3# 촉진제로 두손 무기 제작#l\r\n";
		str += "#L4# 한손 무기 제작#l\r\n";
		str += "#L5# 두손 무기 제작#l\r\n";
		cm.sendSimple(str);
	} else if (status == 1)
	{
		if (selection >= 2)
		{
			var str = "그래? 어떤 무기를 만들고 싶은가?\r\n#b";
			if (selection == 2)
			{
				str += "#L0# 한손검#l\r\n";
				str += "#L1# 한손도끼#l\r\n";
				str += "#L2# 한손둔기#l\r\n";
				str += "#L3# 단검#l\r\n";
				str += "#L4# 완드#l\r\n";
				str += "#L5# 스태프#l\r\n";
			} 
			else if (selection == 3)
			{
				str += "#L6# 두손검#l\r\n";
				str += "#L7# 두손도끼#l\r\n";
				str += "#L8# 두손둔기#l\r\n";
				str += "#L9# 창#l\r\n";
				str += "#L10# 폴암#l\r\n";
				str += "#L11# 활#l\r\n";
				str += "#L12# 석궁#l\r\n";
				str += "#L13# 아대#l\r\n";
			}
			else if (selection == 4)
			{
				str += "#L20# 한손검#l\r\n";
				str += "#L21# 한손도끼#l\r\n";
				str += "#L22# 한손둔기#l\r\n";
				str += "#L23# 단검#l\r\n";
				str += "#L24# 완드#l\r\n";
				str += "#L25# 스태프#l\r\n";
			} 
			else if (selection == 5)
			{
				str += "#L26# 두손검#l\r\n";
				str += "#L27# 두손도끼#l\r\n";
				str += "#L28# 두손둔기#l\r\n";
				str += "#L29# 창#l\r\n";
				str += "#L30# 폴암#l\r\n";
				str += "#L31# 활#l\r\n";
				str += "#L32# 석궁#l\r\n";
				str += "#L33# 아대#l\r\n";
			}
			cm.sendSimple(str);
		} 
		else if (selection == 0)
		{
			cm.sendOk("촉진제는 여러 아이템을 만들때 첨가할 수 있는 특수한 약이지. 몬스터에게서 구하실 수 있을거야. 어쨌든, 촉진제는 아이템을 만들때 일정 확률로 옵션이 더 좋아질 수 있게 되지. 하지만 10%의 확률로 제작에 실패할 수도 있으니 신중하게 결정해야하지.");
			cm.dispose();
		}
		else if (selection == 1)
		{
			cm.sendOk("아이템 제조법은 무기를 제작할때 필요한 제조법이라네. 아마 몬스터들에게서 구할 수 있을걸세.");
			cm.dispose();
		}
	} else if (status == 2)
	{
		var str = "어떤 무기를 제작하고 싶나?\r\n#b";
		if (selection == 0)
		{
			items = [
				{itemid:1302008, level:30, material:[[4131000,1],[4130002,1],[4011001,2],[4011004,2],[4003000,30]], cost:18000},
				{itemid:1302004, level:35, material:[[4131000,1],[4130002,1],[4011006,1],[4011001,5],[4021006,3],[4003000,35]], cost:35000},
				{itemid:1302009, level:40, material:[[4131000,1],[4130002,1],[4011006,3],[4021000,5],[4011001,5],[4003000,40]], cost:70000},
				{itemid:1302010, level:50, material:[[4131000,1],[4130002,1],[4005000,1],[4021008,2],[4011006,4],[4021003,10],[4003000,50]], cost:200000}
			];
		} else if (selection == 1)
		{
			items = [
				{itemid:1312005, level:30, material:[[4131001,1],[4130003,1],[4011001,2],[4021000,2],[4003000,30]], cost:18000},
				{itemid:1312006, level:35, material:[[4131001,1],[4130003,1],[4011001,5],[4021000,5],[4011004,3],[4003000,35]], cost:35000},
				{itemid:1312007, level:40, material:[[4131001,1],[4130003,1],[4021005,7],[4011001,5],[4021001,5],[4003000,40]], cost:70000},
				{itemid:1312008, level:50, material:[[4131001,1],[4130003,1],[4005000,1],[4021008,2],[4011004,8],[4011001,10],[4003000,50]], cost:200000}
			];
		} else if (selection == 2)
		{
			items = [
				{itemid:1322014, level:30, material:[[4131002,1],[4130004,1],[4011001,2],[4011000,3],[4003000,30]], cost:18000},
				{itemid:1322015, level:35, material:[[4131002,1],[4130004,1],[4011001,5],[4011000,5],[4011003,3],[4003000,35]], cost:35000},
				{itemid:1322016, level:40, material:[[4131002,1],[4130004,1],[4011003,7],[4011001,5],[4011004,5],[4003000,40]], cost:70000},
				{itemid:1322017, level:50, material:[[4131002,1],[4130004,1],[4005000,1],[4021008,2],[4011006,4],[4011001,10],[4003000,50]], cost:200000}
			];
		} else if (selection == 3)
		{
			items = [
				{itemid:1332012, level:30, material:[[4131012,1],[4130014,1],[4011002,2],[4011001,3],[4003000,30]], cost:20000},
				{itemid:1332009, level:30, material:[[4131012,1],[4130014,1],[4021005,2],[4011001,3],[4003000,30]], cost:20000},
				{itemid:1332014, level:35, material:[[4131012,1],[4130014,1],[4021005,1],[4011001,5],[4011002,3],[4003000,35]], cost:33000},
				{itemid:1332011, level:40, material:[[4131012,1],[4130014,1],[4011001,7],[4011006,3],[4021006,6],[4003000,40]], cost:73000},
				{itemid:1332016, level:50, material:[[4131012,1],[4130014,1],[4005003,1],[4021008,2],[4011004,7],[4011001,10],[4003000,50]], cost:230000},
				{itemid:1332003, level:50, material:[[4131012,1],[4130014,1],[4005003,1],[4021007,2],[4011006,5],[4011001,10],[4003000,50]], cost:230000}
			];
		} else if (selection == 4)
		{
			items = [
				{itemid:1372003, level:28, material:[[4131008,1],[4130010,1],[4011002,3],[4021002,1],[4003000,10]], cost:15000},
				{itemid:1372001, level:33, material:[[4131008,1],[4130010,1],[4021006,5],[4011002,3],[4011001,1],[4003000,15]], cost:30000},
				{itemid:1372000, level:38, material:[[4131008,1],[4130010,1],[4021006,5],[4021005,5],[4021007,1],[4003003,1],[4003000,20]], cost:60000},
				{itemid:1372007, level:48, material:[[4131008,1],[4130010,1],[4011006,4],[4021003,3],[4021007,3],[4021002,1],[4003000,30]], cost:100000}
			];
		} else if (selection == 5)
		{
			items = [
				{itemid:1382002, level:25, material:[[4131009,1],[4130011,1],[4021006,2],[4021001,1],[4011001,1],[4003000,15]], cost:10000},
				{itemid:1382001, level:45, material:[[4131009,1],[4130011,1],[4011001,8],[4021001,5],[4021006,5],[4021005,5],[4003000,30]], cost:80000},
				{itemid:1382006, level:55, material:[[4131009,1],[4130011,1],[4005001,2],[4021008,2],[4011006,5],[4011004,10],[4003000,40]], cost:200000}
			];
		} else if (selection == 6)
		{
			items = [
				{itemid:1402002, level:30, material:[[4131003,1],[4130005,1],[4011001,2],[4021000,1],[4021004,2],[4003000,35]], cost:20000},
				{itemid:1402006, level:35, material:[[4131003,1],[4130005,1],[4011006,1],[4011001,5],[4021004,5],[4003000,40]], cost:37000},
				{itemid:1402007, level:40, material:[[4131003,1],[4130005,1],[4021003,7],[4011000,5],[4011001,5],[4003000,45]], cost:72000},
				{itemid:1402003, level:50, material:[[4131003,1],[4130005,1],[4005000,1],[4021007,2],[4011006,4],[4011001,10],[4003000,55]], cost:220000}
			];
		} else if (selection == 7)
		{
			items = [
				{itemid:1412006, level:30, material:[[4131004,1],[4130006,1],[4021005,2],[4011001,2],[4003001,5],[4003000,35]], cost:20000},
				{itemid:1412004, level:35, material:[[4131004,1],[4130006,1],[4011004,5],[4011000,5],[4021003,3],[4003000,40]], cost:37000},
				{itemid:1412005, level:40, material:[[4131004,1],[4130006,1],[4011006,3],[4011004,5],[4011001,5],[4003000,45]], cost:72000},
				{itemid:1412003, level:50, material:[[4131004,1],[4130006,1],[4005000,1],[4021007,2],[4021006,7],[4011006,5],[4003000,55]], cost:220000}
			];
		} else if (selection == 8)
		{
			items = [
				{itemid:1422001, level:30, material:[[4131005,1],[4130007,1],[4011001,2],[4011004,3],[4003000,35]], cost:20000},
				{itemid:1422008, level:35, material:[[4131005,1],[4130007,1],[4011001,5],[4011000,5],[4003001,10],[4003000,40]], cost:37000},
				{itemid:1422007, level:40, material:[[4131005,1],[4130007,1],[4011006,3],[4011004,5],[4011001,5],[4003000,45]], cost:72000},
				{itemid:1422005, level:50, material:[[4131005,1],[4130007,1],[4005000,1],[4021008,2],[4021006,7],[4011006,5],[4003000,55]], cost:220000}
			];
		} else if (selection == 9)
		{
			items = [
				{itemid:1432002, level:30, material:[[4131006,1],[4130008,1],[4011000,2],[4011004,3],[4003000,40]], cost:22000},
				{itemid:1432003, level:35, material:[[4131006,1],[4130008,1],[4011001,5],[4011002,5],[4021000,3],[4003000,45]], cost:39000},
				{itemid:1432005, level:40, material:[[4131006,1],[4130008,1],[4011004,3],[4011001,5],[4011000,5],[4003000,50]], cost:74000},
				{itemid:1432004, level:50, material:[[4131006,1],[4130008,1],[4005000,1],[4021008,2],[4011000,7],[4021000,5],[4003000,60]], cost:240000}
			];
		} else if (selection == 10)
		{
			items = [
				{itemid:1442001, level:30, material:[[4131007,1],[4130009,1],[4011000,2],[4011002,3],[4003000,40]], cost:22000},
				{itemid:1442003, level:35, material:[[4131007,1],[4130009,1],[4011001,5],[4011002,5],[4011000,3],[4003000,45]], cost:39000},
				{itemid:1442009, level:40, material:[[4131007,1],[4130009,1],[4011006,3],[4011002,5],[4011001,5],[4003000,50]], cost:74000},
				{itemid:1442005, level:50, material:[[4131007,1],[4130009,1],[4005000,1],[4021007,2],[4011001,7],[4011002,5],[4003000,60]], cost:240000}
			];
		} else if (selection == 11)
		{
			items = [
				{itemid:1452005, level:30, material:[[4131010,1],[4130012,1],[4011001,5],[4011006,5],[4021003,3],[4021006,3],[4003000,30]], cost:15000},
				{itemid:1452006, level:35, material:[[4131010,1],[4130012,1],[4011004,7],[4021000,6],[4021004,3],[4003000,35]], cost:20000},
				{itemid:1452007, level:40, material:[[4131010,1],[4130012,1],[4021008,1],[4011001,10],[4011006,3],[4003000,40],[4000112,100]], cost:40000},
				{itemid:1452008, level:50, material:[[4131010,1],[4130012,1],[4005002,1],[4021008,2],[4011001,10],[4021005,6],[4003000,50]], cost:100000}
			];
		} else if (selection == 12)
		{
			items = [
				{itemid:1462004, level:32, material:[[4131011,1],[4130013,1],[4011001,5],[4011005,5],[4021006,3],[4003001,50],[4003000,15]], cost:15000},
				{itemid:1462005, level:38, material:[[4131011,1],[4130013,1],[4021008,1],[4011001,8],[4011006,4],[4021006,2],[4003000,30]], cost:25000},
				{itemid:1462006, level:42, material:[[4131011,1],[4130013,1],[4021008,2],[4011004,6],[4003001,30],[4003000,30]], cost:41000},
				{itemid:1462007, level:50, material:[[4131011,1],[4130013,1],[4021008,2],[4011006,5],[4021006,3],[4003001,40],[4003000,40]], cost:100000}
			];
		} else if (selection == 13)
		{
			items = [
				{itemid:1472009, level:30, material:[[4130015,1],[1472008,1],[4011002,3]], cost:10000},
				{itemid:1472010, level:30, material:[[4130015,1],[1472008,1],[4011003,3]], cost:15000},
				{itemid:1472012, level:35, material:[[4130015,1],[1472011,1],[4011004,4]], cost:20000},
				{itemid:1472013, level:35, material:[[4130015,1],[1472011,1],[4021008,1]], cost:25000},
				{itemid:1472015, level:40, material:[[4130015,1],[1472014,1],[4021000,5]], cost:30000},
				{itemid:1472016, level:40, material:[[4130015,1],[1472014,1],[4011003,5]], cost:30000},
				{itemid:1472017, level:40, material:[[4130015,1],[1472014,1],[4021008,2]], cost:35000},
				{itemid:1472019, level:50, material:[[4130015,1],[1472018,1],[4021000,6]], cost:40000},
				{itemid:1472020, level:50, material:[[4130015,1],[1472018,1],[4021005,6]], cost:40000},
				{itemid:1472021, level:50, material:[[4130015,1],[1472018,1],[4005003,1],[4021008,3]], cost:50000}
			];
		} else if (selection == 20)
		{
			items = [
				{itemid:1302008, level:30, material:[[4131000,1],[4011001,2],[4011004,2],[4003000,30]], cost:18000},
				{itemid:1302004, level:35, material:[[4131000,1],[4011006,1],[4011001,5],[4021006,3],[4003000,35]], cost:35000},
				{itemid:1302009, level:40, material:[[4131000,1],[4011006,3],[4021000,5],[4011001,5],[4003000,40]], cost:70000},
				{itemid:1302010, level:50, material:[[4131000,1],[4005000,1],[4021008,2],[4011006,4],[4021003,10],[4003000,50]], cost:200000}
			];
		} else if (selection == 21)
		{
			items = [
				{itemid:1312005, level:30, material:[[4131001,1],[4011001,2],[4021000,2],[4003000,30]], cost:18000},
				{itemid:1312006, level:35, material:[[4131001,1],[4011001,5],[4021000,5],[4011004,3],[4003000,35]], cost:35000},
				{itemid:1312007, level:40, material:[[4131001,1],[4021005,7],[4011001,5],[4021001,5],[4003000,40]], cost:70000},
				{itemid:1312008, level:50, material:[[4131001,1],[4005000,1],[4021008,2],[4011004,8],[4011001,10],[4003000,50]], cost:200000}
			];
		} else if (selection == 22)
		{
			items = [
				{itemid:1322014, level:30, material:[[4131002,1],[4011001,2],[4011000,3],[4003000,30]], cost:18000},
				{itemid:1322015, level:35, material:[[4131002,1],[4011001,5],[4011000,5],[4011003,3],[4003000,35]], cost:35000},
				{itemid:1322016, level:40, material:[[4131002,1],[4011003,7],[4011001,5],[4011004,5],[4003000,40]], cost:70000},
				{itemid:1322017, level:50, material:[[4131002,1],[4005000,1],[4021008,2],[4011006,4],[4011001,10],[4003000,50]], cost:200000}
			];
		} else if (selection == 23)
		{
			items = [
				{itemid:1332012, level:30, material:[[4131012,1],[4011002,2],[4011001,3],[4003000,30]], cost:20000},
				{itemid:1332009, level:30, material:[[4131012,1],[4021005,2],[4011001,3],[4003000,30]], cost:20000},
				{itemid:1332014, level:35, material:[[4131012,1],[4021005,1],[4011001,5],[4011002,3],[4003000,35]], cost:33000},
				{itemid:1332011, level:40, material:[[4131012,1],[4011001,7],[4011006,3],[4021006,6],[4003000,40]], cost:73000},
				{itemid:1332016, level:50, material:[[4131012,1],[4005003,1],[4021008,2],[4011004,7],[4011001,10],[4003000,50]], cost:230000},
				{itemid:1332003, level:50, material:[[4131012,1],[4005003,1],[4021007,2],[4011006,5],[4011001,10],[4003000,50]], cost:230000}
			];
		} else if (selection == 24)
		{
			items = [
				{itemid:1372003, level:28, material:[[4131008,1],[4011002,3],[4021002,1],[4003000,10]], cost:15000},
				{itemid:1372001, level:33, material:[[4131008,1],[4021006,5],[4011002,3],[4011001,1],[4003000,15]], cost:30000},
				{itemid:1372000, level:38, material:[[4131008,1],[4021006,5],[4021005,5],[4021007,1],[4003003,1],[4003000,20]], cost:60000},
				{itemid:1372007, level:48, material:[[4131008,1],[4011006,4],[4021003,3],[4021007,3],[4021002,1],[4003000,30]], cost:100000}
			];
		} else if (selection == 25)
		{
			items = [
				{itemid:1382002, level:25, material:[[4131009,1],[4021006,2],[4021001,1],[4011001,1],[4003000,15]], cost:10000},
				{itemid:1382001, level:45, material:[[4131009,1],[4011001,8],[4021001,5],[4021006,5],[4021005,5],[4003000,30]], cost:80000},
				{itemid:1382006, level:55, material:[[4131009,1],[4005001,2],[4021008,2],[4011006,5],[4011004,10],[4003000,40]], cost:200000}
			];
		} else if (selection == 26)
		{
			items = [
				{itemid:1402002, level:30, material:[[4131003,1],[4011001,2],[4021000,1],[4021004,2],[4003000,35]], cost:20000},
				{itemid:1402006, level:35, material:[[4131003,1],[4011006,1],[4011001,5],[4021004,5],[4003000,40]], cost:37000},
				{itemid:1402007, level:40, material:[[4131003,1],[4021003,7],[4011000,5],[4011001,5],[4003000,45]], cost:72000},
				{itemid:1402003, level:50, material:[[4131003,1],[4005000,1],[4021007,2],[4011006,4],[4011001,10],[4003000,55]], cost:220000}
			];
		} else if (selection == 27)
		{
			items = [
				{itemid:1412006, level:30, material:[[4131004,1],[4021005,2],[4011001,2],[4003001,5],[4003000,35]], cost:20000},
				{itemid:1412004, level:35, material:[[4131004,1],[4011004,5],[4011000,5],[4021003,3],[4003000,40]], cost:37000},
				{itemid:1412005, level:40, material:[[4131004,1],[4011006,3],[4011004,5],[4011001,5],[4003000,45]], cost:72000},
				{itemid:1412003, level:50, material:[[4131004,1],[4005000,1],[4021007,2],[4021006,7],[4011006,5],[4003000,55]], cost:220000}
			];
		} else if (selection == 28)
		{
			items = [
				{itemid:1422001, level:30, material:[[4131005,1],[4011001,2],[4011004,3],[4003000,35]], cost:20000},
				{itemid:1422008, level:35, material:[[4131005,1],[4011001,5],[4011000,5],[4003001,10],[4003000,40]], cost:37000},
				{itemid:1422007, level:40, material:[[4131005,1],[4011006,3],[4011004,5],[4011001,5],[4003000,45]], cost:72000},
				{itemid:1422005, level:50, material:[[4131005,1],[4005000,1],[4021008,2],[4021006,7],[4011006,5],[4003000,55]], cost:220000}
			];
		} else if (selection == 29)
		{
			items = [
				{itemid:1432002, level:30, material:[[4131006,1],[4011000,2],[4011004,3],[4003000,40]], cost:22000},
				{itemid:1432003, level:35, material:[[4131006,1],[4011001,5],[4011002,5],[4021000,3],[4003000,45]], cost:39000},
				{itemid:1432005, level:40, material:[[4131006,1],[4011004,3],[4011001,5],[4011000,5],[4003000,50]], cost:74000},
				{itemid:1432004, level:50, material:[[4131006,1],[4005000,1],[4021008,2],[4011000,7],[4021000,5],[4003000,60]], cost:240000}
			];
		} else if (selection == 30)
		{
			items = [
				{itemid:1442001, level:30, material:[[4131007,1],[4011000,2],[4011002,3],[4003000,40]], cost:22000},
				{itemid:1442003, level:35, material:[[4131007,1],[4011001,5],[4011002,5],[4011000,3],[4003000,45]], cost:39000},
				{itemid:1442009, level:40, material:[[4131007,1],[4011006,3],[4011002,5],[4011001,5],[4003000,50]], cost:74000},
				{itemid:1442005, level:50, material:[[4131007,1],[4005000,1],[4021007,2],[4011001,7],[4011002,5],[4003000,60]], cost:240000}
			];
		} else if (selection == 31)
		{
			items = [
				{itemid:1452005, level:30, material:[[4131010,1],[4011001,5],[4011006,5],[4021003,3],[4021006,3],[4003000,30]], cost:15000},
				{itemid:1452006, level:35, material:[[4131010,1],[4011004,7],[4021000,6],[4021004,3],[4003000,35]], cost:20000},
				{itemid:1452007, level:40, material:[[4131010,1],[4021008,1],[4011001,10],[4011006,3],[4003000,40],[4000112,100]], cost:40000},
				{itemid:1452008, level:50, material:[[4131010,1],[4005002,1],[4021008,2],[4011001,10],[4021005,6],[4003000,50]], cost:100000}
			];
		} else if (selection == 32)
		{
			items = [
				{itemid:1462004, level:32, material:[[4131011,1],[4011001,5],[4011005,5],[4021006,3],[4003001,50],[4003000,15]], cost:15000},
				{itemid:1462005, level:38, material:[[4131011,1],[4021008,1],[4011001,8],[4011006,4],[4021006,2],[4003000,30]], cost:25000},
				{itemid:1462006, level:42, material:[[4131011,1],[4021008,2],[4011004,6],[4003001,30],[4003000,30]], cost:41000},
				{itemid:1462007, level:50, material:[[4131011,1],[4021008,2],[4011006,5],[4021006,3],[4003001,40],[4003000,40]], cost:100000}
			];
		} else if (selection == 33)
		{
			items = [
				{itemid:1472008, level:30, material:[[4131013,1],[4011000,3],[4011001,2],[4000021,50],[4003000,20]], cost:15000},
				{itemid:1472011, level:35, material:[[4131013,1],[4011000,4],[4011001,3],[4000021,80],[4003000,25]], cost:30000},
				{itemid:1472014, level:40, material:[[4131013,1],[4011000,3],[4011001,4],[4000021,100],[4003000,30]], cost:40000},
				{itemid:1472018, level:50, material:[[4131013,1],[4011000,4],[4011001,5],[4000030,40],[4003000,35]], cost:50000}
			];
		}
		sim = selection < 20;
		for (var i = 0;i < items.length ; ++i)
		{
			var arItem = items[i];
			str += "\r\n#b#L"+i+"# #i" + arItem['itemid'] +"# #z" + arItem['itemid'] +"##k";
		}
		cm.sendSimple(str);
	} else if (status == 3)
	{
		myItem = items[selection];
		var str = "만들고 싶은 아이템이 #b#t" + myItem['item'] + "##k 인가? 재료는 아래와 같다네.\r\n";
		for (var i = 0; i < myItem['material'].length; ++i)
		{
			var mat = myItem['material'][i];
			str += "#b#v" + mat[0] + "# #t" + mat[0] + "# " + mat[1] +"개#k\r\n";
		}
		if (myItem['cost'] > 0)
		{
			str += "#b#i4031138# " + myItem['cost'] + " 메소#k\r\n";
		}
		str += "\r\n이 아이템을 정말 만들어 보겠나?";
		cm.sendYesNo(str);
	}
	else if (status == 4)
	{
		if (selection == 0)
		{
			cm.sendOk("그런가? 아직 재료가 부족한 모양이지? 준비가 되면 언제든지 나를 찾아오게나.");
			cm.dispose();
			return;
		} else {
			if (myItem['cost'] > 0)
			{
				if (cm.getMeso() < myItem['cost'])
				{
					cm.sendOk("제작 수수료는 올바르게 갖고 있는건가? 다시 한번 확인해 주겠나?");
					cm.dispose();
					return;
				}
			}
			for (var i = 0;i < myItem['material'].length ; ++i)
			{
				if (!cm.haveItem(myItem['material'][i][0], myItem['material'][i][1]))
				{
					cm.sendOk("흐음. 재료중에 부족한 재료가 있는 것 같군. 다시 한번 확인해 주겠나?");
					cm.dispose();
					return;
				}
			}
			if (!cm.canHold(myItem['itemid']))
			{
				cm.sendOk("인벤토리 공간이 부족한거 아닌가..? 제대로 다시 한번 확인해 보게.");
				cm.dispose();
				return;
			}
			if (myItem['cost'] > 0)
			{
				cm.gainMeso(-myItem['cost']);
			}
			for (var i = 0;i < myItem['material'].length ; ++i)
			{
				cm.gainItem(myItem['material'][i][0], -myItem['material'][i][1])
			}
			if (sim)
			{
				cm.gainItem(myItem['itemid'], 1, true);
			} else {
				cm.gainItem(myItem['itemid'], 1);
			}
			//cm.gainItem(myItem['itemid'], 1);
			cm.sendOk("자, 다 되었다네. 어떤가? 멋진 물건이지? 다음에도 필요하면 언제든지 나를 찾아오게나!");
			cm.dispose();
		}
	}
}