var status = -1;
var facetype;
var needItem = 4310092;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 0) {
        cm.dispose();
        return;
    } else {
        status++;
    }

    if (status == 0) {
        var face = cm.getPlayerStat("FACE");
	var customData = cm.getQuestRecord(50011);
            if (customData.getCustomData() == "남자") {
            facetype = [20013,20021,20022,20024,20025,20027,20028,20029,20030,20031,20032,20036,20037,20040,20043,20044,20045,20046,20047,20048,20049,20050,20053,20055,20056,20057,20058,20059,20060,20061,20062,20063,20064,20065,20066,20067,20068,20069,20070,20074,20075,20076,20077,20080,20081,20082,20083,20084,20085,20086,20087,20088,20089,20090,20093,20094,20095,20097,20098,20099];
        } else {
            facetype = [21021,21023,21024,21026,21027,21028,21029,21030,21031,21036,21043,21044,21045,21046,21047,21048,21053,21055,21056,21057,21058,21059,21060,21061,21062,21063,21064,21065,21066,21067,21069,21070,21074,21075,21077,21080,21081,21082,21083,21084,21085,21086,21089,21090,21093,21094,21095,21097,21098];
        }
        for (var i = 0; i < facetype.length; i++) {
            facetype[i] = facetype[i] + face % 1000 - (face % 100);
        }
        cm.askAvatar("어떤 얼굴로 바꿔보고 싶은가?", facetype);
    } else if (status == 1){
		if (cm.haveItem(4310092,2000)) {
        if (cm.setAvatar(needItem, facetype[selection]) == 1) {
            cm.sendOk("자아~ 다 됐다네. 어떤가? 맘에 들지? 다음에 또 이 덴마 님을 찾아주게나~");
		cm.gainItem(4310092,-1999);
	    } else {
		cm.sendOk("죄송하지만 리얼코인이 부족한것 같은데요?");
		}
	    } else {
		cm.sendOk("죄송하지만 리얼코인이 부족한것 같은데요?");
		}
        cm.dispose();
    }
}
