var status = 0;

var Uq = new Array(4033247,4310080,4220000,4001783,4001782,5060002,1442028,1442029,1442030,1442027,1442026,1442017,1442016,1442015,1442014,1442013,1442011,1442012,1302021,1302048,1322021,1322022,1322023,1322024,1322025,1322026,1032025,5060002,4220000,1302013,1102246,1082533,1082276,1082145,1082146,1082147,1082148,1082149,1082150,1072369,1051210,1050169,1002045,1002046,1002707,1002006,1000040,1492194,1482183,1472230,1462208,1452220,1442121,1442122,1442123,1432182,1402205,1402214,1382215,1382216,1382226,1382191,1382127,1382019,1382017,1382018,1382015,1382016,1382011,1372033,1372008,1372012,1372015,2044303,2040807,2043003,2044003,2043703,2043803,2044503,2044603,2044703,2043303,1302291,1332242,1322027,1302049,1402010,1402013,1402017,1402035,1302027,1302028,1302029,1302025,1302026,1302024,1302016,1302017,1322003,1092019,1092020,1092021,1092022,1092029,1432015,1432016,1432017,1432018,1432009,1432008,1442039,1302063,1102053,1052217,1142656,1142681,1142184,1142650,1142630,1142623,1142629,1142620,1142622,1142613,1142614,1142606,1142080,1142081,1142082,1142083,1142084,1142170,1142122,1142136,1142135,1142126,1142134,1142142,1142137,1142139,1142138,1142140,1142141,1142151,1142150,1142149,1142145,1142144,1142143,1142172,1142152,1142171,1142249,1142190,1142188,1142244,1142228,1142227,1142226,1102061,1102109,4020009,4021019,4005000,4005001,4005002,4005003,4005004,4033087,4000992,4033875,4170012,4032264,4032265,4032266,4440101,4441101,4442101,4443101,4440001,4441001,4442001,4443001,4001115,4001116,4021037,5060002,4001782,2043001,2044001,2044301,2044401,2044801,2044701,2043201,2049100,2044201,2043701,2044901,2043801,2044501,2044601,2043301,2040931,2040924,2040901,2040804,2049100,2041013,2041016,2041019,2040321,2040301,2040317);
var Uqr = Math.floor(Math.random()*Uq.length);

function action(mode, type, selection){

	if(status == 0){
		cm.sendSimple("안녕하세요 저는 이피온월드의 #b돌#k#r림#k#d판#k 월묘 입니다. 오늘은 어떤 유저분이 돌림판에서 유니크한 아이템을 GET 할지 정말 궁금하군요 어서들 도전해보시라구요!\r\n#b#L0#돌림판 티켓을 헤어에 이용하기#l\r\n");
		status++;
	} else if(status == 1) {
		if (selection == 0) {
		if (cm.haveItem(4001783,1)) {
		cm.gainItem(Eq[Eqr],Eq[Eqr]);
		cm.gainItem(4001783,-1);
		cm.sendOk("얏호 돌림판에서 #b#i"+Eq[Eqr]+"# #t"+Eq[Eqr]+"# "+Eq[Eqr]+"#k개를 획득하였어요!");
		cm.dispose();
		} else {
		cm.sendOk("#b#i4001783# #t4001783#이 없는것 같은데요...?");
		cm.dispose();
		}
		} else if (selection == 1) {
		if (cm.haveItem(4001783,1)) {
		cm.gainItem(Eq[Eqr],1);
		cm.gainItem(4001783,-1);
		cm.sendOk("얏호 돌림판에서 #b#i"+Eq[Eqr]+"# #t"+Eq[Eqr]+"# "+Eq[Eqr]+"#k개를 획득하였어요!");
		cm.dispose();
		} else {
		cm.sendOk("#b#i4001783# #t4001783#이 없는것 같은데요...?");
		cm.dispose();
		}
		} else if (selection == 2) {
		if (cm.haveItem(4001783,1)) {
		cm.gainItem(Uq[Uqr],1);
		cm.gainItem(4001783,-1);
		cm.sendOk("얏호 희귀한 돌림판에서 #b#i"+Uq[Uqr]+"# #t"+Uq[Uqr]+"#을(를) 획득하였어요!");
		cm.getPlayer().ServerNotice("핫타임 : "+cm.getPlayer().getName()+"님이 희귀한 돌림판에서 "+cm.getItemName(Uq[Uqr])+"을(를) 획득하였습니다.");
		cm.dispose();
		} else {
		cm.sendOk("#b#i4001783# #t4001783#이 없는것 같은데요...?");
		cm.dispose();
		}
		} else if (selection == 4) {
		cm.sendSimple("핫타임이벤트에 참여하셨나봐요. 이거이거 구하기 힘든 티켓인데 제가 최신성형이나, 최신캐쉬아이템으로 무작위로 바꿔드릴게요 어떤 것에 티켓을 사용할거에요?\r\n#b#L0#최신성형에 쿠폰을 사용할래.#l\r\n#L1#최신 캐쉬모자에 사용할래.#l\r\n#L2#최신 캐쉬한벌옷,망토에 사용할래.#l\r\n#L3#최신 캐쉬신발,장갑,악세사리에 사용할래.#l\r\n#L4#최신 캐쉬무기에 사용할래.#l\r\n#L5#뽀대용 의자에 사용할래.#l\r\n");
	        status++;
}
		} else if(status == 2) {
		if (selection == 0) {
		cm.dispose();
		cm.openNpc(9000269);
		} else if (selection == 1) {
		if (cm.haveItem(4001782,1)) {
		if (cm.canHold(NC[NCr])) {
		cm.gainItem(NC[NCr],1);
		cm.gainItem(4001782,-1);
		cm.sendOk("얏호 핫타임 돌림판에서 #b#i"+NC[NCr]+"# #t"+NC[NCr]+"##k를 획득하였어요!");
		cm.dispose();
		} else {
		cm.sendOk("이런이런 인벤토리를 비우고 돌리는것이 상식이라구요.");
		cm.dispose();
		}
		} else {
		cm.sendOk("#b#i4001782# #t4001782#이 없는것 같은데요...?");
		cm.dispose();
		}
		} else if (selection == 2) {
		if (cm.haveItem(4001782,1)) {
		if (cm.canHold(AC[ACr])) {
		cm.gainItem(AC[ACr],1);
		cm.gainItem(4001782,-1);
		cm.sendOk("얏호 핫타임 돌림판에서 #b#i"+AC[ACr]+"# #t"+AC[ACr]+"##k를 획득하였어요!");
		cm.dispose();
		} else {
		cm.sendOk("이런이런 인벤토리를 비우고 돌리는것이 상식이라구요.");
		cm.dispose();
		}
		} else {
		cm.sendOk("#b#i4001782# #t4001782#이 없는것 같은데요...?");
		cm.dispose();
		}
		} else if (selection == 3) {
		if (cm.haveItem(4001782,1)) {
		if (cm.canHold(eC[eCr])) {
		cm.gainItem(eC[eCr],1);
		cm.gainItem(4001782,-1);
		cm.sendOk("얏호 핫타임 돌림판에서 #b#i"+eC[eCr]+"# #t"+eC[eCr]+"##k를 획득하였어요!");
		cm.dispose();
		} else {
		cm.sendOk("이런이런 인벤토리를 비우고 돌리는것이 상식이라구요.");
		cm.dispose();
		}
		} else {
		cm.sendOk("#b#i4001782# #t4001782#이 없는것 같은데요...?");
		cm.dispose();
		}
	} else if (selection == 4) {
		if (cm.haveItem(4001782,1)) {
		if (cm.canHold(wC[wCr])) {
		cm.gainItem(wC[wCr],1);
		cm.gainItem(4001782,-1);
		cm.sendOk("얏호 핫타임 돌림판에서 #b#i"+wC[wCr]+"# #t"+wC[wCr]+"##k를 획득하였어요!");
		cm.dispose();
		} else {
		cm.sendOk("이런이런 인벤토리를 비우고 돌리는것이 상식이라구요.");
		cm.dispose();
		}
		} else {
		cm.sendOk("#b#i4001782# #t4001782#이 없는것 같은데요...?");
		cm.dispose();
		}
	} else if (selection == 5) {
		if (cm.haveItem(4001782,1)) {
		if (cm.canHold(CH[CHr])) {
		cm.gainItem(CH[CHr],1);
		cm.gainItem(4001782,-1);
		cm.sendOk("얏호 핫타임 돌림판에서 #b#i"+CH[CHr]+"# #t"+CH[CHr]+"##k를 획득하였어요!");
		cm.dispose();
		} else {
		cm.sendOk("이런이런 인벤토리를 비우고 돌리는것이 상식이라구요.");
		cm.dispose();
		}
		} else {
		cm.sendOk("#b#i4001782# #t4001782#이 없는것 같은데요...?");
		cm.dispose();
		}
		}
		}

	}
